Repository: lukaskaibel/LOGIT
Catalog: LOGIT/Core/Environment/*.lproj/Localizable.strings
Languages: de

# abdominals
source: Abs
de: Bauch

source: Accept Privacy Policy
de: Datenschutzbestimmungen akzeptieren

source: Add
de: Hinzufügen

source: Add Exercise
de: Übung hinzufügen

source: Add exercises from below.
de: Übungen von unten auswählen.

source: Add Measurement
de: Messung hinzufügen

source: Add Measurements
de: Messungen hinzufügen

source: Add Note
de: Notiz hinzufügen

source: Add Note...
de: Notiz hinzufügen...

source: Add Set
de: Satz hinzufügen

source: Add Workout
de: Workout hinzufügen

source: Afternoon
de: Nachmittag

source: All
de: Alle

source: All Entries
de: Alle Einträge

source: All sets completed
de: Alle Sätze vollständig

source: All Time
de: Aller Zeiten

source: already exists.
de: existiert schon.

source: Are you sure?
de: Bist du sicher?

# autoRenewMonth
source: Automatically renews every month
de: Erneuert automatisch am Ende des Monats

source: Ascending
de: Aufsteigend

source: Available with
de: Verfügbar mit

source: Back
de: Rücken

source: Best
de: Max

source: Best Last Month
de: Max letzten Monat

source: Best per Day
de: Höchstes pro Tag

source: Best this Month
de: Max diesen Monat

source: Best Weight per Day
de: Höchstes Gewicht pro Tag

# bestRepetitionsPerDay
source: Best Reps per Day
de: Höchste Wdh. pro Tag

source: Biceps
de: Bizeps

source: Biceps Left
de: Linker Bizeps

source: Biceps Right
de: Rechter Bizeps

# bodyFatPercentage
source: Body Fat
de: Körperfett

source: Body Parts
de: Körperteile

source: Bodyweight
de: Körpergewicht

source: Cancel
de: Abbrechen

source: Cardio
de: Ausdauer

source: Change Goal
de: Ziel Ändern

source: Charts
de: Diagramme

# chartsPromotionText
source: From weight to reps, volume, and sets – visualize every step of your fitness journey!
de: Tracke deinen Fitnessfortschritt, wie z.B. Gewicht, Volumen und mehr...

source: Chest
de: Brust

source: Choose Exercise
de: Übung auswählen

source: Choose Secondary Exercise
de: Zweite Übung auswählen

# chooseTemplateText
source: Choose a template or start an empty workout
de: Vorlage auswählen oder leeres Workout starten

source: Completed
de: Geschafft

source: Continue
de: Weiter

source: Continue Workout
de: Workout fortführen

source: Copy Repetitions
de: Wiederholungen kopieren

source: Copy Set
de: Satz kopieren

source: Copy Weight
de: Gewicht kopieren

source: Core Metrics
de: Basis

source: Create Exercise
de: Übung erstellen

source: Create Template
de: Vorlage erstellen

source: Creating Template Failed
de: Generieren Fehlgeschlagen

# creatingTemplateFailedText
source: Make sure the selected image contains a workout.
de: Stelle sicher, dass das Bild ein Workout enthält.

source: Current Best
de: Aktuelle Bestleistung

# currentBestInfo
source: Current Best displays your top attempt this month or, if none, your most recent prior attempt.
de: Aktuelle Bestleistung zeigt Ihren besten Versuch dieses Monats oder, falls keiner vorhanden ist, Ihren letzten vorherigen Versuch.

source: Current Workout
de: Aktuelles Workout

source: Date
de: Datum

source: Default Exercises
de: Standard Übungen

# defaultExercisesDescription
source: Do you want to use the default exercise library?
de: Möchtest du die standard Übungen benutzen?

source: Delete
de: Löschen

# deleteExerciseConfirmation
source: Do you want to delete the exercise? This action can not be undone.
de: Möchtest du die Übung unwiderruflich löschen?

# deleteSets
source: Delete Sets and Finish Workout
de: Sätze löschen und Workout beenden

# deleteSetsWithoutEntries
source: Delete all sets without entries and finish workout?
de: Alle Sätze ohne Einträge löschen und Workout beenden?

source: Delete Template
de: Vorlage löschen

# deleteTemplateMsg
source: Do you want to delete this Template? This cannot be undone.
de: Möchtest du diese Vorlage unwiderruflich löschen?

source: Delete Workout
de: Workout löschen

# deleteWorkoutDescription
source: Delete Workout? This action cannot be undone.
de: Workout unwiderruflich löschen?

source: Descending
de: Absteigend

source: Discard Workout
de: Workout verwerfen

source: Dismiss
de: Verwerfen

source: Done
de: Fertig

source: Drop Count
de: Anzahl Drops

source: Dropset
de: Dropsatz

source: Duration
de: Dauer

source: Edit
de: Bearbeiten

source: Edit Date / Time
de: Datum / Zeit bearbeiten

source: Edit Note
de: Notiz bearbeiten

source: Edit Template
de: Vorlagen bearbeiten

source: Edit Time
de: Zeit bearbeiten

source: Edit Workout
de: Workout bearbeiten

source: Eight
de: Acht

source: End
de: Ende

source: End Workout
de: Workout beenden

source: Evening
de: Abend

source: Exercise
de: Übung

source: Exercise Name
de: Übungsname

# exerciseNameCantStartWithDefault
source: Exercise name cannot start with "_default". This prefix is reserved for built-in exercises.
de: Übungsname darf nicht mit "_default" beginnen. Dieses Präfix ist für eingebaute Übungen reserviert.

# exerciseNameDescription
source: Enter the name for the exercise.
de: Gib den Namen der Übung ein.

source: Exercises
de: Übungen

source: Finish Setup
de: Set-Up beenden

source: Finish Workout
de: Workout beenden

# finishWorkoutConfimation
source: Do you want to finish the workout?
de: Möchtest du das Workout beenden?

source: Five
de: Fünf

source: Focus
de: Fokus

source: Focused On
de: Fokussiert auf

source: Focus This Week
de: Fokus diese Woche

source: Four
de: Vier

source: Four weeks ago
de: Vor 4 Wochen

source: from last week
de: zu letzter Woche

source: From Photo
de: Aus Foto

source: Hidden
de: Ausgeblendet

source: History
de: Ausführungen

source: Generate Template
de: Vorlage generieren

source: Generate Workout
de: Workout generieren

source: Generating Template
de: Vorlage wird erstellt

source: Generating Workout
de: Workout wird erstellt

source: Generating Workout Failed
de: Workout erstellen fehlgeschlagen

# generatingWorkoutFailedText
source: Make sure the photo contains a workout and try again.
de: Stelle sicher, dass das Foto ein Workout enthält und versuche es erneut.

source: Goal
de: Ziel

source: Incomplete sets will not be saved.
de: Unvollständige Sätze werden nicht gespeichert.

source: In Selected Week
de: In Ausgewählter Woche

source: Latest
de: Aktuell

source: Last month
de: Letzter Monat

# lastTenWorkouts
source: In Last 10 Workouts
de: In Letzten 10 Workouts

source: Last used
de: Zuletzt benutzt

source: Last week
de: Letzte Woche

source: Last Workout
de: Letztes Workout

source: Legs
de: Beine

source: Let's get started
de: Los gehts

# letsGetStartedDescription
source: Before you can start working out we need to do a quick setup to optimise your experience.
de: Bevor du trainieren kannst müssen wir ein kurzen Set-Up machen.

source: Licence Agreement
de: Lizenzvereinbarung

source: Maximum Weight
de: Maximales Gewicht

source: Maximum Repetitions
de: Maximale Wiederholungen

source: Max Reps
de: Max Wdh

source: Max Weight
de: Max Gewicht

# measurementBodyweight
source: Bodyweight
de: Körpergewicht

# measurementCaloriesBurned
source: Calories Burned
de: Verbrannte Kalorien

source: Hips
de: Hüfte

source: Calf Left
de: Wade Links

source: Forearm Left
de: Unterarm Links

source: Thigh Left
de: Oberschenkel Links

source: Neck
de: Hals

source: Calf Right
de: Wade Rechts

source: Forearm Right
de: Unterarm Rechts

source: Thigh Right
de: Oberschenkel Rechts

source: Shoulders
de: Schultern

source: Waist
de: Taille

source: Measurements
de: Messungen

# measurementsPromotionDescription
source: Plot bodyweight, calories, and other metrics to clearly see your progress.
de: Verfolge weitere wichtige Fitnessmetriken, wie Körpergewicht, Kalorien und mehr...

source: Missing
de: Fehlen

source: Month
de: Monat

source: Monthly
de: Monatlich

source: Morning
de: Morgen

source: Muscle Group
de: Muskelgruppe

source: Muscle Groups
de: Muskelgruppen

# muscleGroupsInLastTen
source: Muscle Group Overview
de: Muskelgruppen Übersicht

source: Muscle Group Split
de: Muskelgruppen Aufteilung

source: Muscle Mass
de: Muskelmasse

source: My Templates
de: Meine Vorlagen

source: Name can't be empty.
de: Name kann nicht leer sein.

# navBack
source: Back
de: Zurück

source: Never
de: Nie

source: Newest First
de: Neueste zuerst

source: New Exercise
de: Neue Übung

source: New Template
de: Vorlage erstellen

# newTemplateFromWorkout
source: Use as Template...
de: Als Vorlage verwenden...

source: New Workout
de: Neues Workout

source: Night
de: Nacht

source: Nine
de: Neun

source: No Attempts
de: Keine Ausführungen

source: No Data
de: Keine Daten

# noEntriesConfirmation
source: This workout has no entries. Discard it?
de: Das Workout hat kein Einträge. Workout verwerfen?

source: No Exercises
de: Keine Übungen

# noExercisesInWeek
source: No Exercise in Week
de: Keine Übungen in der Woche

# noExercisesTip
source: Exercise Library 🏋️
de: Noch keine Übungen

# noExercisesTipDescription
source: Craft your personal Exercise library and categorize by muscle group. Click below to start adding your first Exercise!
de: Erstelle deine persönliche Übungsbibliothek.

source: No History
de: Keine Ausführungen

source: No Measurements
de: Keine Messungen

source: No Name
de: Ohne Namen

source: None
de: Keine

source: Noon
de: Mittag

source: No Templates
de: Keine Vorlagen

# noTemplatesTip
source: Plan Ahead 📋
de: Noch keine Vorlagen

# noTemplatesTipDescription
source: Use Templates to organize and plan your workouts in advance. Click below to create your first workout Template!
de: Speichere deine Lieblingsroutinen für schnellen Zugriff.

source: Notifications Disabled
de: Benachrichtigungen deaktiviert

# notificationsDisabledMessage
source: To allow the timer to play a sound and show when it ends, notifications must be enabled.
de: Damit der Timer einen Ton abspielen und das Ende anzeigen kann, müssen Benachrichtigungen aktiviert sein.

source: Now
de: Jetzt

source: No Widgets Added
de: Keine Widgets hinzugefügt

source: No Workouts
de: Keine Workouts

source: No Workouts in Week
de: Keine Workouts in der Woche

source: No Workouts this Week
de: Keine Workouts in dieser Woche

# noWorkoutsTip
source: Lets Work-Out 💪
de: Noch keine Workouts

# noWorkoutsTipDescription
source: You haven't logged any Workouts in LOGIT yet. Start your journey by clicking the button at the bottom of the screen to record your first Workout!
de: Beginne mit dem Tracking, um deinen Fortschritt zu verfolgen.

source: Oldest First
de: Älteste zuerst

source: One
de: Eins

# onlyFewSeconds
source: This will only take a few seconds...
de: Dies wird nur ein paar Sekunden dauern...

source: Open Settings
de: Einstellungen öffnen

source: Overall Sets
de: Gesamte Sätze

source: Overall Volume
de: Gesamtes Volumen

source: Overview
de: Überblick

source: Pause
de: Stop

source: Performed
de: Ausführungen:

source: Personal Best
de: Persönliche Bestleistung

source: per Day
de: pro Tag

source: Per Day
de: Pro Tag

source: Per Month
de: Pro Monat

source: per week
de: pro Woche

source: Per Week
de: Pro Woche

source: Pin Exercises
de: Übungen anpinnen

source: Pinned
de: Angepinnt

# pressPlusToAdd
source: Press + to add "%@"
de: Drücke +, um "%@" hinzuzufügen

# pressPlusToAddExercise
source: Press + to add an exercise
de: Drücke +, um eine Übung hinzuzufügen

source: Prevent Auto-Lock
de: Bildschirmsperre verhindern

# preventAutoLockDescription
source: Keeps screen active during workout.
de: Verhindert das Abschalten des Bildschirms während des Training.

source: Price
de: Preis

source: Privacy Policy
de: Datenschutzbestimmungen

source: Profile
de: Profil

source: Progress
de: Fortschritt

source: Recent Attempts
de: Letzte Ausführungen

source: Recent Workouts
de: Letzte Workouts

source: Remove
de: Entfernen

source: Rename
de: Umbennen

source: Reordering Done
de: Fertig umsortiert

source: Reorder Exercises
de: Übungen umsortieren

source: Repetitions
de: Wiederholungen

source: Repetitions PR
de: Wiederholungen PR

# reps
source: rps
de: Wdh

source: Replace Exercise
de: Übung ersetzen

source: Replace Secondary Exercise
de: Zweite Übung ersetzen

source: Restore Purchase
de: Kauf Wiederherstellen

source: Save
de: Speichern

source: Save Time
de: Spare Zeit

source: Scan a Template
de: Scanne eine Vorlage

source: Scan a Workout
de: Scanne einen Workout

source: Scan Workout
de: Workout einscannen

# scanAWorkoutPromotionText
source: Convert a photo into a workout and start training instantly!
de: Mache aus einem Foto blitzschnell eine Workout-Vorlage!

source: Search
de: Suche

# searchEverything
source: Search
de: Suchen

# searchPrompt
source: Search Everything
de: Alles durchsuchen

# searchPromptDescription
source: Search across all your exercises, workouts, and templates in one place.
de: Suche in all deinen Übungen, Workouts und Vorlagen an einem Ort.

# searchExercises
source: Search in Exercises
de: In Übungen suchen

# searchWorkouts
source: Search in Workouts
de: In Workouts suchen

# noSearchResults
source: No Results Found
de: Keine Ergebnisse

# noSearchResultsFor
source: No results found for "%@"
de: Keine Ergebnisse für "%@"

# showMoreResults
source: Show %d more results
de: %d weitere Ergebnisse anzeigen

source: sec
de: sek

source: Select Duration
de: Dauer auswählen

source: Select Exercise
de: Übung auswählen

source: Select Muscle Group
de: Muskelgruppe auswählen

source: Select Secondary Exercise
de: Zweite Übung auswählen

source: Select Template
de: Vorlage auswählen

source: Set
de: Satz

source: Sets
de: Sätze

source: Sets incomplete
de: Sätze unvollständig

# setsPerWeek
source: Overall Sets per Week
de: Gesamte Sätze pro Woche

source: Set Type
de: Satz Art

source: Settings
de: Einstellungen

source: Seven
de: Sieben

source: Show All
de: Alle anzeigen

source: Show All Exercises
de: Alle Übungen anzeigen

source: Show All Measurements
de: Alle Messungen anzeigen

source: Show Details
de: Details anzeigen

source: Show Measurements
de: Messungen anzeigen

source: Show Subscriptions
de: Abonnements anzeigen

source: Six
de: Sechs

source: Skip
de: Überspringen

source: Sort by
de: Sortieren nach

# startEmpty
source: Start Empty Workout
de: Leeres Workout starten

source: Start from Scan
de: Workout scannen

source: Start from Template
de: Aus Vorlage starten

source: Start Setup
de: Set-Up starten

source: Start Time
de: Startzeit

source: Start Workout
de: Workout starten

source: Stopwatch
de: Stoppuhr

source: Subscription
de: Abonnement

source: Summary
de: Zusammenfassung

source: Superset
de: Supersatz

source: Target
de: Ziel

source: Target per week
de: Ziel pro Woche

# targetPerWeekDescription
source: Select your workout target per week.
de: Wähle dein Workout Ziel pro Woche aus.

source: Template
de: Vorlage

# templateExplanation
source: Use Templates to plan and reuse workouts. You can select a Template when starting a workout.
de: Benutze Vorlagen um deine Workouts zu planen und wiederzuverwerten. Du kannst eine Vorlage auswählen, wenn du dein Workout startest.

source: Template from Photo
de: Vorlage aus Foto

# templateFromPhotoDescription
source: Extracts a template from a photo
de: Extrahiert eine Vorlage aus einem Foto

source: Template never used
de: Vorlage nie benutzt

source: Templates
de: Vorlagen

source: This
de: Diese

source: This Month
de: Dieser Monat

source: This Week
de: Diese Woche

source: This Week
de: Diese Woche

source: This Year
de: Dieses Jahr

source: Three
de: Drei

# threeMonths
source: 3 Months
de: 3 Monate

source: Three weeks ago
de: Vor 3 Wochen

source: time
de: mal

# timerIsMuted
source: Timer Muted
de: Timer Stummschalten

source: times
de: mal

source: Time's up!
de: Timer fertig!

# timesUpBody
source: Your workout timer is done.
de: Dein Workout-Timer ist abgelaufen.

source: Title
de: Titel

source: to
de: bis

source: Today
de: Heute

source: to go
de: übrig

source: Total
de: Insgesamt

source: Track More
de: Tracke mehr

source: Triceps
de: Trizeps

source: Two
de: Zwei

source: Two weeks ago
de: Vor 2 Wochen

source: Unit
de: Einheit

# unitDescription
source: Select the unit you want to use. Any previous entries will be converted on change.
de: Wähle eine Einheit. Alle vorherigen Eingaben werden konvertiert.

source: Unpinned
de: Nicht Angepinnt

source: Unused
de: Unbenutzt

source: Upgrade to
de: Upgraden zu

source: Use Default Exercises
de: Standard Übungen benutzen

source: Use Template
de: Vorlage benutzen

source: Volume
de: Volumen

source: Volume this Week
de: Volumen diese Woche

source: Week
de: Woche

source: Weekly
de: Wöchentlich

source: Weekly Average
de: Wöchentlicher Durchschnitt

source: Weekly Target
de: Wöchentliches Ziel

# weeklyTargetDescription
source: Select how many workouts you want to do per week.
de: Wähle aus, wie viele Workouts du pro Woche machen möchtest.

source: Weekly Workout Goal
de: Wöchentliches Workout Ziel

source: Weight
de: Gewicht

source: Weight PR
de: Gewicht PR

source: Weight Unit
de: Gewichts Einheit

# weightUnitDescription
source: Select the unit you want to use throughout the app.
de: Wähle deine bevorzugte Einheit aus.

source: Welcome to
de: Willkommen bei

source: What’s still missing?
de: Was fehlt noch?

source: Week of the
de: Woche vom

source: Workout Goal
de: Workout Ziel

# workoutHistory
source: History
de: Verlauf

source: Workout target
de: Workout Ziel

source: Value
de: Wert

source: Visible
de: Sichtbar

source: Year
de: Jahr

source: Yearly
de: Jährlich

source: Yesterday
de: Gestern

source: Visualise
de: Visualisieren

source: Zero
de: Null

source: Edit Measurements
de: Messungen bearbeiten

# editPinnedMeasurements
source: Edit Pinned
de: Angepinnte bearbeiten

# dragToReorder
source: Drag to reorder measurements
de: Ziehen zum Sortieren

source: No measurements selected
de: Keine Messungen ausgewählt

source: No Date
de: Kein Datum

# avgMoreSetsPerWorkoutThisWeekThanLastWeek
source: You're averaging more sets per workout this week than last week.
de: Du machst im Durchschnitt mehr Sätze pro Workout diese Woche als letzte Woche.

# avgFewerSetsPerWorkoutThisWeekThanLastWeek
source: You're averaging fewer sets per workout this week than last week.
de: Du machst im Durchschnitt weniger Sätze pro Workout diese Woche als letzte Woche.

# avgMoreSetsPerWorkoutThisMonthThanLastMonth
source: You're averaging more sets per workout this month than last month.
de: Du machst im Durchschnitt mehr Sätze pro Workout diesen Monat als letzten Monat.

# avgFewerSetsPerWorkoutThisMonthThanLastMonth
source: You're averaging fewer sets per workout this month than last month.
de: Du machst im Durchschnitt weniger Sätze pro Workout diesen Monat als letzten Monat.

# avgMoreSetsPerWorkoutThisYearThanLastYear
source: You're averaging more sets per workout this year than last year.
de: Du machst im Durchschnitt mehr Sätze pro Workout dieses Jahr als letztes Jahr.

# avgFewerSetsPerWorkoutThisYearThanLastYear
source: You're averaging fewer sets per workout this year than last year.
de: Du machst im Durchschnitt weniger Sätze pro Workout dieses Jahr als letztes Jahr.

# _default.exercise.pushups
source: Push-ups
de: Liegestütze

# _default.exercise.barbellBenchPress
source: Barbell Bench Press
de: Bankdrücken mit Langhantel

# _default.exercise.dumbbellBenchPress
source: Dumbbell Bench Press
de: Bankdrücken mit Kurzhanteln

# _default.exercise.inclinedBarbellBenchPress
source: Incline Barbell Bench Press
de: Schrägbankdrücken mit Langhantel

# _default.exercise.inclinedDumbbellBenchPress
source: Incline Dumbbell Bench Press
de: Schrägbankdrücken mit Kurzhanteln

# _default.exercise.dumbbellFly
source: Dumbbell Fly
de: Kurzhantel Flys

# _default.exercise.cableCrossovers
source: Cable Crossovers
de: Kabelzug Crossovers

# _default.exercise.declineBenchPress
source: Decline Bench Press
de: Negativ-Bankdrücken

# _default.exercise.chestDips
source: Chest Dips
de: Brust-Dips

# _default.exercise.pecDeckFly
source: Pec Deck Fly
de: Butterfly

# _default.exercise.pullups
source: Pull-ups
de: Klimmzüge

# _default.exercise.australianPullups
source: Australian Pull-ups
de: Australische Klimmzüge

# _default.exercise.latPulldowns
source: Lat Pulldowns
de: Latzug

# _default.exercise.barbellRows
source: Barbell Rows
de: Langhantel Rudern

# _default.exercise.dumbbellRows
source: Dumbbell Rows
de: Kurzhantel Rudern

# _default.exercise.seatedCableRows
source: Seated Cable Rows
de: Sitzend Kabelrudern

# _default.exercise.tBarRows
source: T-Bar Rows
de: T-Bar Rudern

# _default.exercise.deadlift
source: Deadlift
de: Kreuzheben

# _default.exercise.sumoDeadlift
source: Sumo Deadlift
de: Sumo Kreuzheben

# _default.exercise.romanianDeadlift
source: Romanian Deadlift
de: Rumänisches Kreuzheben

# _default.exercise.squats
source: Squats
de: Kniebeugen

# _default.exercise.frontSquats
source: Front Squats
de: Frontkniebeugen

# _default.exercise.legPress
source: Leg Press
de: Beinpresse

# _default.exercise.barbellLunges
source: Barbell Lunges
de: Ausfallschritte mit Langhantel

# _default.exercise.dumbbellLunges
source: Dumbbell Lunges
de: Ausfallschritte mit Kurzhanteln

# _default.exercise.legExtension
source: Leg Extension
de: Beinstrecker

# _default.exercise.legCurls
source: Leg Curls
de: Beinbeuger

# _default.exercise.calfRaises
source: Calf Raises
de: Wadenheben

# _default.exercise.seatedCalfRaises
source: Seated Calf Raises
de: Sitzendes Wadenheben

# _default.exercise.bulgarianSplitSquats
source: Bulgarian Split Squats
de: Bulgarische Split Kniebeugen

# _default.exercise.hackSquats
source: Hack Squats
de: Hackenschmidt-Kniebeugen

# _default.exercise.gobletSquats
source: Goblet Squats
de: Goblet Kniebeugen

# _default.exercise.legPressCalfRaise
source: Leg Press Calf Raise
de: Wadenheben an der Beinpresse

# _default.exercise.handstandPushups
source: Handstand Push-ups
de: Handstand Liegestütze

# _default.exercise.militaryPress
source: Military Press
de: Militärpresse

# _default.exercise.shoulderPress
source: Shoulder Press
de: Schulterpresse

# _default.exercise.dumbbellShoulderPress
source: Dumbbell Shoulder Press
de: Kurzhantel Schulterpresse

# _default.exercise.uprightRows
source: Upright Rows
de: Aufrechtes Rudern

# _default.exercise.lateralRaises
source: Lateral Raises
de: Seitheben

# _default.exercise.frontRaises
source: Front Raises
de: Frontheben

# _default.exercise.rearDeltRaise
source: Rear Delt Raise
de: Vorgebeugtes Seitheben

# _default.exercise.cableRaises
source: Cable Raises
de: Kabel Seitheben

# _default.exercise.tricepPushdowns
source: Tricep Pushdowns
de: Trizepsdrücken am Kabel

# _default.exercise.overheadTricepExtension
source: Overhead Tricep Extension
de: Überkopf Trizepsstrecken

# _default.exercise.closeGripBenchPress
source: Close Grip Bench Press
de: Bankdrücken mit engem Griff

# _default.exercise.tricepKickbacks
source: Tricep Kickbacks
de: Trizeps Kickbacks

# _default.exercise.skullCrushers
source: Skull Crushers
de: Stirndrücken

# _default.exercise.diamondPushups
source: Diamond Push-ups
de: Diamant Liegestütze

# _default.exercise.ropeTricepExtensions
source: Rope Tricep Extensions
de: Seil Trizepsstrecken

# _default.exercise.barbellCurls
source: Barbell Curls
de: Langhantel Bizepscurls

# _default.exercise.dumbbellCurls
source: Dumbbell Curls
de: Kurzhantel Bizepscurls

# _default.exercise.concentrationCurls
source: Concentration Curls
de: Konzentrationscurls

# _default.exercise.cableCurls
source: Cable Curls
de: Kabel Bizepscurls

# _default.exercise.inclineDumbbellCurls
source: Incline Dumbbell Curls
de: Schrägbank Kurzhantelcurls

# _default.exercise.ezBarCurls
source: EZ Bar Curls
de: SZ-Stange Curls

# _default.exercise.bicycles
source: Bicycle Crunches
de: Fahrrad Crunches

# _default.exercise.legRaises
source: Leg Raises
de: Beinheben

# _default.exercise.hangingKneeRaises
source: Hanging Knee Raises
de: Hängendes Knieheben
