Repository: lukaskaibel/LOGIT
Catalog: LOGIT/Core/Environment/*.lproj/Localizable.strings
Languages: de

# _default.exercise.plank
source: Plank
de: Unterarmstütz

# _default.exercise.sidePlank
source: Side Plank
de: Seitlicher Unterarmstütz

# _default.exercise.mountainClimbers
source: Mountain Climbers
de: Bergsteiger

# _default.exercise.hangingLegRaises
source: Hanging Leg Raises
de: Hängendes Beinheben

# _default.exercise.cableCrunches
source: Cable Crunches
de: Kabel Crunches

# _default.exercise.running
source: Running
de: Laufen

# _default.exercise.cycling
source: Cycling
de: Radfahren

# _default.exercise.rowing
source: Rowing
de: Rudern

# _default.exercise.jumpRope
source: Jump Rope
de: Seilspringen

# _default.exercise.elliptical
source: Elliptical
de: Crosstrainer

# _default.exercise.stairClimber
source: Stair Climber
de: Treppensteiger

# _default.exercise.swimming
source: Swimming
de: Schwimmen

# _default.exercise.barbellShrugs
source: Barbell Shrugs
de: Langhantel Schulterheben

# _default.exercise.dumbbellShrugs
source: Dumbbell Shrugs
de: Kurzhantel Schulterheben

# _default.exercise.widegripPullups
source: Wide Grip Pull-ups
de: Klimmzüge breiter Griff

# _default.exercise.closegripPullups
source: Close Grip Pull-ups
de: Klimmzüge enger Griff

# _default.exercise.assistedPullups
source: Assisted Pull-ups
de: Unterstützte Klimmzüge

# _default.exercise.chestSupportedRows
source: Chest Supported Rows
de: Brustgestütztes Rudern

# _default.exercise.pendlayRows
source: Pendlay Rows
de: Pendlay Rudern

# _default.exercise.landmineRows
source: Landmine Rows
de: Landmine Rudern

# _default.exercise.cablePulldowns
source: Cable Pulldowns
de: Kabel Pulldowns

# _default.exercise.seatedRowMachine
source: Seated Row Machine
de: Rudermaschine sitzend

# _default.exercise.reverseFly
source: Reverse Fly
de: Reverse Flys

# _default.exercise.backExtensions
source: Back Extensions
de: Rückenstrecken

# _default.exercise.dumbbellPullover
source: Dumbbell Pullover
de: Kurzhantel Pullover

# _default.exercise.machineFly
source: Machine Fly
de: Maschinen Flys

# _default.exercise.inclineCableFly
source: Incline Cable Fly
de: Schrägbank Kabel Flys

# _default.exercise.singleArmCablePress
source: Single Arm Cable Press
de: Einarmiges Kabeldrücken

# _default.exercise.dumbbellFloorPress
source: Dumbbell Floor Press
de: Kurzhantel Bodendrücken

# _default.exercise.legPressWideStance
source: Leg Press Wide Stance
de: Beinpresse breiter Stand

# _default.exercise.legPressNarrowStance
source: Leg Press Narrow Stance
de: Beinpresse enger Stand

# _default.exercise.seatedLegCurls
source: Seated Leg Curls
de: Sitzender Beinbeuger

# _default.exercise.standingLegCurls
source: Standing Leg Curls
de: Stehender Beinbeuger

# _default.exercise.lyingLegCurls
source: Lying Leg Curls
de: Liegender Beinbeuger

# _default.exercise.singleLegDeadlift
source: Single Leg Deadlift
de: Einbeiniges Kreuzheben

# _default.exercise.cableKickbacks
source: Cable Kickbacks
de: Kabel Kickbacks

# _default.exercise.abductorMachine
source: Abductor Machine
de: Abduktorenmaschine

# _default.exercise.adductorMachine
source: Adductor Machine
de: Adduktorenmaschine

# _default.exercise.reverseGripBenchPress
source: Reverse Grip Bench Press
de: Bankdrücken Untergriff

# _default.exercise.seatedInclineCurls
source: Seated Incline Curls
de: Sitzende Schrägbank Curls

# _default.exercise.cableHammerCurls
source: Cable Hammer Curls
de: Kabel Hammercurls

# _default.exercise.wristCurls
source: Wrist Curls
de: Handgelenkbeugen

# _default.exercise.reverseWristCurls
source: Reverse Wrist Curls
de: Reverse Handgelenkbeugen

# _default.exercise.seatedTricepPress
source: Seated Tricep Press
de: Sitzende Trizepspresse

# _default.exercise.oneArmTricepExtension
source: One Arm Tricep Extension
de: Einarmiges Trizepsstrecken

# _default.exercise.tricepDips
source: Tricep Dips
de: Trizeps Dips

# _default.exercise.benchDips
source: Bench Dips
de: Bank Dips

# _default.exercise.reverseGripTricepPushdowns
source: Reverse Grip Tricep Pushdowns
de: Trizepsdrücken Untergriff

# _default.exercise.seatedDumbbellPress
source: Seated Dumbbell Press
de: Sitzende Kurzhantel Presse

# _default.exercise.machineShoulderPress
source: Machine Shoulder Press
de: Schulterdrück-Maschine

# _default.exercise.pikePushups
source: Pike Push-ups
de: Pike Liegestütze

# _default.exercise.behindTheNeckPress
source: Behind The Neck Press
de: Nackendrücken

# _default.exercise.dumbbellScaption
source: Dumbbell Scaption
de: Kurzhantel Scaption

# _default.exercise.cableLateralRaises
source: Cable Lateral Raises
de: Kabel Seitheben

# _default.exercise.bentOverLateralRaises
source: Bent Over Lateral Raises
de: Vorgebeugtes Seitheben

# _default.exercise.reverseDeclineFly
source: Reverse Decline Fly
de: Reverse Decline Flys

# _default.exercise.seatedBentOverLateralRaises
source: Seated Bent Over Lateral Raises
de: Sitzendes vorgebeugtes Seitheben

# _default.exercise.plateFrontRaise
source: Plate Front Raise
de: Scheiben Frontheben

# _default.exercise.barbellFrontRaise
source: Barbell Front Raise
de: Langhantel Frontheben

# _default.exercise.scissorKicks
source: Scissor Kicks
de: Scherenbeinheben

# _default.exercise.obliqueCrunches
source: Oblique Crunches
de: Seitliche Crunches

# _default.exercise.rowingMachine
source: Rowing Machine
de: Rudermaschine

# _default.exercise.snatchGripDeadlift
source: Snatch Grip Deadlift
de: Reißgriff Kreuzheben

# _default.exercise.deficitDeadlift
source: Deficit Deadlift
de: Defizit Kreuzheben

# _default.exercise.trapBarDeadlift
source: Trap Bar Deadlift
de: Trap Bar Kreuzheben

# _default.exercise.cleanAndPress
source: Clean and Press
de: Umsetzen und Drücken

# _default.exercise.snatch
source: Snatch
de: Reißen

# _default.exercise.gobletSquatWithKettlebell
source: Goblet Squat With Kettlebell
de: Goblet Squat mit Kettlebell

# _default.exercise.singleArmKettlebellPress
source: Single Arm Kettlebell Press
de: Einarmige Kettlebell Presse

# _default.exercise.ropeClimbs
source: Rope Climbs
de: Seilklettern

# _default.exercise.sledPush
source: Sled Push
de: Schlitten Drücken

# _default.exercise.sledPull
source: Sled Pull
de: Schlitten Ziehen

# _default.exercise.tireFlips
source: Tire Flips
de: Reifenumdrehen

# _default.exercise.medicineBallSlams
source: Medicine Ball Slams
de: Medizinball Slams

# _default.exercise.ringPushups
source: Ring Push-ups
de: Ring Liegestütze

# _default.exercise.ringRows
source: Ring Rows
de: Ring Rudern
